---
kind: property
id: P:Autodesk.Revit.DB.MEPAnalyticalConnectionType.PressureLoss
source: html/74624771-7eca-8142-21f5-108e5cf476f2.htm
---
# Autodesk.Revit.DB.MEPAnalyticalConnectionType.PressureLoss Property

The pressure loss of this analytical connection type.

## Syntax (C#)
```csharp
public double PressureLoss { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for pressureLoss must be non-negative.